/**
 * Object containing error codes and their corresponding descriptions for ZarinPal payment gateway.
 * 
 * This list is based on the official documentation provided by ZarinPal.
 * 
 * @constant
 * @link https://docs.zarinpal.com/paymentGateway/error.html
 */
export const zarinPalErrors: Record<string, string> = {
  "-9": "خطای اعتبار سنجی",
  "-10": "ای پی و يا مرچنت كد پذيرنده صحيح نيست.",
  "-11": "مرچنت کد فعال نیست لطفا با تیم پشتیبانی ما تماس بگیرید.",
  "-12": "تلاش بیش از حد در یک بازه زمانی کوتاه.",
  "-15": "ترمینال شما به حالت تعلیق در آمده با تیم پشتیبانی تماس بگیرید.",
  "-16": "سطح تاييد پذيرنده پايين تر از سطح نقره اي است.",
  "-50": "مبلغ پرداخت شده با مقدار مبلغ در تایید شده متفاوت است.",
  "-51": "پرداخت ناموفق",
  "-30": "پذیرنده اجازه دسترسی به سرویس تسویه اشتراکی شناور را ندارد.",
  "-31":
    "حساب بانکی تسویه را به پنل اضافه کنید. مقادیر وارد شده برای تسهیم درست نیست. پذیرنده جهت استفاده از خدمات سرویس تسویه اشتراکی شناور، باید حساب بانکی معتبری به پنل کاربری خود اضافه نماید.",
  "-32": "مبلغ وارد شده از مبلغ کل تراکنش بیشتر است.",
  "-33": "درصدهای وارد شده صحیح نیست.",
  "-34": "مبلغ وارد شده از مبلغ کل تراکنش بیشتر است.",
  "-35": "تعداد افراد دریافت کننده تسهیم بیش از حد مجاز است.",
  "-36": "حداقل مبلغ جهت تسهیم باید ۱۰۰۰۰ ریال باشد",
  "-37": "یک یا چند شماره شبای وارد شده برای تسهیم از سمت بانک غیر فعال است.",
  "-38": "خطا٬عدم تعریف صحیح شبا٬لطفا دقایقی دیگر تلاش کنید.",
  "-39": "خطایی رخ داده است به امور مشتریان زرین پال اطلاع دهید",
  "-52": "خطای غیر منتظره با پشتیبانی تماس بگیرید.",
  "-53": "اتوریتی برای این مرچنت کد نیست.",
  "-54": "اتوریتی نامعتبر است.",
  "101": "تراکنش قبلا یک بار تایید شده است.",
};
